---
type: PushButtonData
namespace: Autodesk.Revit.UI
version: 2024
members: 4
tags: [revit-api, class]
---

# PushButtonData

`Autodesk.Revit.UI.PushButtonData` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | PushButtonData | — | `public PushButtonData ( string name , string text , string assemblyName , string className )` |
| Property | AssemblyName | — | `public string AssemblyName { get ; set ; }` |
| Property | AvailabilityClassName | 2011 | `public string AvailabilityClassName { get ; set ; }` |
| Property | ClassName | — | `public string ClassName { get ; set ; }` |